Revit 2027 API
FabricationConfiguration.GetAllPartStatuses Method
 Gets all possible fabrication part status identifiers.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<int> GetAllPartStatuses()
Public Function GetAllPartStatuses As IList(Of Integer)
public:
IList<int>^ GetAllPartStatuses()
member GetAllPartStatuses : unit -> IList<int>
Return Value
IList<Int32>
 An array of status identifiers.
See Also
Reference
FabricationConfiguration Class
Autodesk.Revit.DB Namespace